BarberShipAdminWebApp/quiko/app/Controllers/Cliente.php

    public function editar($id){
        $cliente = $this->clientes->where('id',$id)->first();
---
SELECT *
FROM `clientes`
WHERE `id` = '24'
 LIMIT 1