BarberShopAPI/BarberShop/app/Controllers/Auth.php

    public function verifyToken(){
        $key = Services::getSecretKey();
        $token_str = $this->request->getHeader("token")->getValue();
        try{
            $token = JWT::decode($token_str, new key($key, 'HS256'));
        }catch(\Throwable $th){
            $token = false;
        }
        if(!$token){
            return $token;
        }else{
            if($token->data->tipo == "cliente"){
                $clienteModel = new ClienteModel();
                $this->cliente = $clienteModel->find($token->data->user_id);
                $this->tipoUsuario = "cliente";
            }else if($token->data->tipo == "barbero"){
                $barberoModel = new BarberoModel();
                $this->barbero = $barberoModel->find($token->data->user_id);
---
SELECT *
FROM `barberos`
WHERE `barberos`.`id` = '1'