BarberShopAPI/BarberShop/app/Controllers/Cita.php

    public function barbero_cita($id){
        if(!$this->verifyToken()){return $this->respond(["error" =>"Token expirado"]);}
        if($this->tipoUsuario != "barbero"){return $this->respond(["error" => "No tienes permisos para acceder a esta ruta"]);}
        $barberoModel = new BarberoModel();
        $data=[
            "citas" => $this->model->obtenerPorBarbero($id),
            "barbero" => $barberoModel->find($id)
        ];
---
SELECT *
FROM `citas`
WHERE `citas`.`id` = '2'
SELECT *
FROM `barberos`
WHERE `barberos`.`id` = '1'