BarberShopAPI/BarberShop/app/Models/BarberoModel.php

    public function login($usuario, $password){
        $result = $this->asArray()->where([
            "telefono" => $usuario,
            "password" => $password
        ])->orWhere([
            "correo" => $usuario,
            "password" => $password
        ])->first();
---
SELECT *
FROM `barberos`
WHERE `telefono` = 'papap'
AND `password` = 'asjlkajds'
OR `correo` = 'papap'
OR `password` = 'asjlkajds'
 LIMIT 1