BarberShopAPI/BarberShop/app/Models/CitaModel.php

    public function obtenerPorBarbero($id){
        $result = $this->asArray()->where(["idBarbero" => $id])->findAll();
---
SELECT *
FROM `citas`
WHERE `idBarbero` = '1'