BarberShopAPI/BarberShop/app/Models/ClienteModel.php

SELECT *
FROM `clientes`
WHERE `telefono` = 'papap'
AND `password` = 'asjlkajds'
OR `correo` = 'papap'
OR `password` = 'asjlkajds'
 LIMIT 1
---
    public function login($usuario, $password){
        $usuario = $this->db->escape($usuario);
        $password = $this->db->escape($password);
        $result = $this->asArray()
        ->where("telefono = {$usuario} AND pasword = {$password} OR correo = {$usuario} AND pasword = {$password}")->first();